{
	"title": "Blog Posts",
	"blogPosts": [
		{
			"id": 1,
			"title": "First International Trip: Exploring Taiwan",
			"date": "November 2025",
			"thumbnail": "blog/taiwan/small/JiufenTaiwan.jpg",
			"excerpt": "My first international travel experience with my girlfriend took us to Taiwan. We explored famous tourist spots in Taipei, indulged in local cuisine and street food delights. Our first day was a DIY adventure, while the second and third days were guided tours booked through Klook, giving us the perfect mix of spontaneity and convenience."
		},
		{
			"id": 2,
			"title": "Starting My Fitness Journey: Boxing & Muay Thai",
			"date": "March 2025",
			"thumbnail": "blog/boxing-and-muay-thai/small/MMAGym.jpg",
			"excerpt": "As a software engineer, sitting for the majority of my day became the norm. To break this sedentary lifestyle, I enrolled in an MMA gym to learn boxing and muay thai. Beyond staying active, training has become my outlet for releasing stress and clearing my mind. It's been an incredible journey of discipline, physical growth, and mental resilience."
		},
		{
			"id": 3,
			"title": "I Got Inked by Apo Whang-od",
			"date": "November 2024",
			"thumbnail": "blog/buscalan/small/ApoWhangOd.jpg",
			"excerpt": "A memorable journey with my girlfriend to Buscalan, a small mountain village home to the Butbut tribe. We immersed ourselves in their rich culture and had the once-in-a-lifetime experience of getting tattooed by the legendary Apo Whang-od, the oldest traditional tattoo artist in the Philippines. A trip that left a permanent mark, both on our skin and in our hearts."
		},
		{
			"id": 4,
			"title": "Planting Trees for Mother Nature",
			"date": "October 2024",
			"thumbnail": "blog/tree-planting-puray/small/TreePlantingPuray.jpg",
			"excerpt": "Volunteering to plant trees in Puray, Rodriguez, Rizal with my girlfriend and our environmental group NSMN (Newborn Steward for Mother Nature). As an advocate for saving our nature, this wasn't my first tree planting activity, but every opportunity to give back to the environment is meaningful. It's always fulfilling to contribute to reforestation and inspire others to care for our planet."
		},
		{
			"id": 5,
			"title": "Playground of the Gods",
			"date": "April 2023",
			"thumbnail": "blog/pulag/small/Pulag.jpg",
			"excerpt": "Hiking Mount Pulag with my girlfriend - a beginner-friendly mountain that the 18KM trek makes harder than it seems. We started our adventure at 1AM and reached the summit around 9AM. The exhausting climb was absolutely worth it when we witnessed the breathtaking view from the top, standing among the clouds in the Philippines' third highest peak."
		},
		{
			"id": 6,
			"title": "My First Solo Travel: Sagada Adventure",
			"date": "August 2022",
			"thumbnail": "blog/sagada/small/Sagada.jpg",
			"excerpt": "Embarking on my first solo adventure to Sagada, I booked everything myself - transportation, hotel, and tours. With little prior knowledge of what to expect, I explored this mountain province blindly, discovering its breathtaking caves, hanging coffins, and stunning sunrise views. A DIY trip that taught me independence and the joy of spontaneous exploration."
		}
	]
}